trade_exp/src/Documents/ПриобретениеУслугПрочихАктивов/ПриобретениеУслугПрочихАктивов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриобретениеУслугПрочихАктивов</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Руководитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетОрганизации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ФормаОплаты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчетКонтрагента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЗакупкаПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ПодразделениеОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЭтоЗатратыПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>УПДАктОтПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>_Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2373e4ed-7dfa-4702-afa9-7a49ffe93157">
    <name>ДатаАктаОтПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="285fc519-6042-40bc-bfb2-341e823756eb">
    <name>Водитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cf93793d-bd1a-4abd-be34-2aa0c671ef23">
    <name>Автомобиль</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9a0e2a0c-4f47-493e-8984-be9ff25bc79f">
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="8b83e65e-41fc-4f1f-8f2e-f33f07070d11">
    <name>ПрибытиеНаОтгрузку</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d00b8315-1114-493a-b5bd-6c10509dae59">
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Расходы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Содержание</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>1000</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КомментарийРаспределения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОснованиеЗатрат</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b14e1790-ac00-460e-9656-31b62e963ccb">
      <name>СтатьяРасходовБУ</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="2a74cd19-a14f-4c73-a83e-9cc5a3651298">
      <name>СкладОснованияЗатрат</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="961aa91f-f258-47f3-b868-9673a4117b30">
      <name>Рейсы</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="c3900451-0683-4a94-9b3a-a1e23ac7028e">
      <name>ЗаказНаДоставку</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="3ff6a3eb-0fa6-496a-951a-ed075c58d8bd">
      <name>ОбъектРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="e3ee02ad-1208-4c1c-8b3d-5545d6658f2e">
      <name>АналитикаОбъекта</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/СтатусыАвансовогоОтчета/СтатусыАвансовогоОтчета.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>СтатусыАвансовогоОтчета</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Подготовлен</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ПриобретениеУслугПрочихАктивов/Forms/ФормаДокумента/Module.bsl
&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)

	Док_ВидимостьДоступность();

	Если Параметры.Свойство("РейсОтПоставщика") Тогда
		РейсОтПоставщика = Параметры.РейсОтПоставщика;
		Если ЗначениеЗаполнено(РейсОтПоставщика) Тогда
			Объект.Партнер = РейсОтПоставщика.ПеревозчикПартнер;
			ПриИзмененииПартнераСервер();

			Объект.Контрагент = РейсОтПоставщика.Перевозчик;
			ПриИзмененииКонтрагентаСервер();

			Объект.ЭтоЗатратыПоДоставке = Истина;
			ЗатратыПоДоставкеПриИзменении();

			Объект.УПДАктОтПеревозчика = РейсОтПоставщика.УПДАктОтПеревозчика;
			Объект.НомерВходящегоДокумента = РейсОтПоставщика.УПДАктОтПеревозчика;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура Док_ПриЧтенииНаСервереПосле(ТекущийОбъект)
	//	
КонецПроцедуры

&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	ОбновитьДанныеПоТН();
КонецПроцедуры

&НаКлиенте
Процедура Док_ЭтоЗатратыПоДоставкеПриИзменении(Элемент)
	ЗатратыПоДоставкеПриИзменении();
КонецПроцедуры

&НаСервере
Процедура ЗатратыПоДоставкеПриИзменении()

	Объект.ЦенаВключаетНДС = Истина;
	Если Объект.ЭтоЗатратыПоДоставке = Ложь Тогда
		Если АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Ссылка, "ЭтоЗатратыПоДоставке") И Объект._Статус
			= ПредопределенноеЗначение("Перечисление.СтатусыАвансовогоОтчета.Утвержден") Тогда
			Объект.ЭтоЗатратыПоДоставке = Истина;
			АльтерраОбщегоНазначения.СообщитьПользователю(Объект.Ссылка, "Документ уже утвержден!", "_Статус");
		Иначе
			Объект._Статус = Неопределено;
		КонецЕсли;
	КонецЕсли;
	Док_ВидимостьДоступность();

КонецПроцедуры

&НаСервере
Процедура Док_ВидимостьДоступность()

	Элементы.ГруппаСтатус.Доступность = Объект.ЭтоЗатратыПоДоставке;
	Элементы.ГруппаНомер.Доступность = Объект.ЭтоЗатратыПоДоставке;
	Элементы.ГруппаПеревозчки.Доступность = Объект.ЭтоЗатратыПоДоставке;

	Элементы.Расходы_ЗаполнитьНаОснованииРейсов.Доступность = Объект.ЭтоЗатратыПоДоставке;
	Элементы.Расходы_ЗаполнитьНаОснованииРейсовОтПоставщиков.Доступность = Объект.ЭтоЗатратыПоДоставке;
	Элементы.ФормаПровестиИЗакрыть.Видимость = Не РольДоступна("_ЗапретПроведенияПриобретениеУслугПрочихАктивов");
	Элементы.ФормаПровести.Видимость = Не РольДоступна("_ЗапретПроведенияПриобретениеУслугПрочихАктивов");

КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеПоТН()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслуг.Ссылка В (&Ссылки)
	|			ТОГДА ПриобретениеТоваровУслуг.Ссылка
	|		ИНАЧЕ ПриобретениеТоваровУслуг.АналитикаРасходов
	|	КОНЕЦ КАК Ссылка,
	|	МАКСИМУМ(ПриобретениеТоваровУслуг.Ссылка.ТНВСоставеДокументовНаТовар) КАК ТНВСоставеДокументовНаТовар,
	|	МАКСИМУМ(ПриобретениеТоваровУслуг.Ссылка.ТННекорректноеОформление) КАК ТННекорректноеОформление
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	(ПриобретениеТоваровУслуг.Ссылка В (&Ссылки)
	|	ИЛИ ПриобретениеТоваровУслуг.АналитикаРасходов В (&Ссылки))
	|	И (СТРЗАМЕНИТЬ(ПриобретениеТоваровУслуг.Ссылка.Партнер.Наименование, "" "", """") ПОДОБНО ""%транспортныерасходы%""
	|	ИЛИ СТРЗАМЕНИТЬ(ПриобретениеТоваровУслуг.Ссылка.Контрагент.Наименование, "" "", """") ПОДОБНО ""%транспортныерасходы%"")
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПриобретениеТоваровУслуг.Ссылка В (&Ссылки)
	|			ТОГДА ПриобретениеТоваровУслуг.Ссылка
	|		ИНАЧЕ ПриобретениеТоваровУслуг.АналитикаРасходов
	|	КОНЕЦ";

	Запрос.УстановитьПараметр("Ссылки", Объект.Расходы.Выгрузить().ВыгрузитьКолонку("ОснованиеЗатрат"));

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Элементы.РасходыТНСданОператору.Видимость = Ложь;
		Элементы.РасходыТННеверноОформлена.Видимость = Ложь;
	Иначе
		Элементы.РасходыТНСданОператору.Видимость = Истина;
		Элементы.РасходыТННеверноОформлена.Видимость = Истина;

		РезультатЗапроса = РезультатЗапроса.Выбрать();
		Пока РезультатЗапроса.Следующий() Цикл
			СтрокиПоиска = Объект.Расходы.НайтиСтроки(Новый Структура("ОснованиеЗатрат", РезультатЗапроса.Ссылка));
			Для Каждого Стр Из СтрокиПоиска Цикл
				Стр.ТНСданОператору = РезультатЗапроса.ТНВСоставеДокументовНаТовар;
				Стр.ТННеверноОформлена = РезультатЗапроса.ТННекорректноеОформление;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;     

КонецПроцедуры

#Область ЗатратыПоДоставкеОтКлиентов
&НаКлиенте
Процедура Док__ЗаполнитьНаОснованииРейсов(Команда)

	ПараметрыФормы = Новый Структура;
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщить("Выберете организацию!");
		Возврат;
	КонецЕсли;

	Организация = ?(ПреобразоватьОрганизациюПоУсловию(), АльтерраОбщегоНазначения.ПолучитьАльтерра(),
		Объект.Организация);
	ПараметрыФормы.Вставить("Организация", Организация);

	Если ЗначениеЗаполнено(Объект.Подразделение) Тогда
		ПараметрыФормы.Вставить("Подразделение", Объект.Подразделение);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Партнер) Тогда
		ПараметрыФормы.Вставить("Партнер", Объект.Партнер);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыФормы.Вставить("Контрагент", Объект.Контрагент);
	КонецЕсли;

	Оповещение= Новый ОписаниеОповещения("ОбработатьВыбранныеРейсы", ЭтотОбъект);

	ОткрытьФорму("Документ.ЗаданиеНаПеревозкуРейс.Форма.ФормаВыбораДляПриобретенияУслугИПрочихАктивов", ПараметрыФормы,
		ЭтаФорма, , , , Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	ЭтаФорма.Модифицированность = Истина;

КонецПроцедуры

&НаСервере
Функция ПреобразоватьОрганизациюПоУсловию()

	Организация1СК = Справочники.Организации.НайтиПоРеквизиту("ИНН", "2208056528");

	Если Объект.Организация = Организация1СК Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура ОбработатьВыбранныеРейсы(Результат, ДопПараметры) Экспорт

	Объект.Расходы.Очистить();
	ОбработатьВыбранныеРейсыНаСервере(Результат);

КонецПроцедуры

&НаСервере
Процедура ИнициализацияСвойствПоПервойСтроке(ПерваяСтрока)

	Объект.Подразделение = Справочники.СтруктураПредприятия.ПустаяСсылка();

	Объект.Организация = ПерваяСтрока.Организация;
	ПриИзмененииОрганизацииСервер();

	Объект.Партнер = ПерваяСтрока.ПеревозчикПартнер;
	ПриИзмененииПартнераСервер();

	Объект.Контрагент = ПерваяСтрока.Перевозчик;
	ПриИзмененииКонтрагентаСервер();

	Объект.ЭтоЗатратыПоДоставке = Истина;
	ЗатратыПоДоставкеПриИзменении();

	ДокРейс = ПерваяСтрока.Рейсы;
	Объект.УПДАктОтПеревозчика = ДокРейс.УПДАктОтПеревозчика;
	Объект.ДатаАктаОтПеревозчика = ДокРейс.ДатаАктаОтПеревозчика;

	Объект.НомерВходящегоДокумента = ДокРейс.УПДАктОтПеревозчика;
	Объект.ДатаВходящегоДокумента = ДокРейс.ДатаАктаОтПеревозчика;

КонецПроцедуры

&НаСервере
Процедура ОбработатьВыбранныеРейсыНаСервере(Результат)

	Если ЗначениеЗаполнено(Результат) Тогда
		ТЗ = Неопределено;

		Если ТипЗнч(Результат) = Тип("Массив") Тогда
			Если ЗначениеЗаполнено(Объект.Организация) Тогда
				ТЗ = Документы.ПриобретениеУслугПрочихАктивов.ПолучитьДокументыПродажи(Результат, Объект.Организация);
				Если ЗначениеЗаполнено(ТЗ) Тогда
					ТЗ = ПолучитьИзВременногоХранилища(ТЗ[0]);
				КонецЕсли;
			Иначе
				ОбщегоНазначения.СообщитьПользователю("Необходимо сначала заполнить организацию!");
			КонецЕсли;
		Иначе
			ТЗ = ПолучитьИзВременногоХранилища(Результат);
			Если ЗначениеЗаполнено(ТЗ) Тогда
				ИнициализацияСвойствПоПервойСтроке(ТЗ[0]);
			КонецЕсли;
		КонецЕсли;

		Если ЗначениеЗаполнено(ТЗ) Тогда
			Для Каждого Стр Из ТЗ Цикл
				НоваяСтрока = Объект.Расходы.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
			КонецЦикла;
		КонецЕсли;

		ОбновитьДанныеПоТН();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция СкорректироватьСуммуПоСтавкеНДС(Дата, СуммаРасчета) Экспорт

	СтавкаНДСПоУмолчанию = УчетНДСУП.СтавкаНДСПоУмолчанию(,Дата);
	СтавкаНДСЧислом = УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(СтавкаНДСПоУмолчанию);
	СуммаНДС = УчетНДСКлиентСервер.РассчитатьСуммуНДС(СуммаРасчета, Истина, СтавкаНДСЧислом);

	НоваяСумма = СуммаРасчета - СуммаНДС;

	Возврат НоваяСумма;

КонецФункции

&НаСервере
Процедура ПересчитатьНДС(ТекущаяСтрока)

	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);

	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, Неопределено);

КонецПроцедуры

&НаКлиенте
Процедура Док__СтатусПриИзменении(Элемент)
	Док__СтатусПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура Док__СтатусПриИзмененииНаСервере()

	Если Объект._Статус <> Объект.Ссылка._Статус И ЗначениеЗаполнено(Объект.Ссылка._Статус) Тогда
		Если РольДоступна("ПолныеПрава") Или РольДоступна("УтверждатьПоступлениеУслугИПрочихАктивов") Тогда
		Иначе
			Объект._Статус= Объект.Ссылка._Статус;
			АльтерраОбщегоНазначения.СообщитьПользователю(Объект.Ссылка, "У вас нет прав менять статус!", "_Статус");
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ЗатратыПоДоставкеОтПоставщиков
&НаКлиенте
Процедура ЗаполнитьНаОснованииРейсовОтПоставщиков(ПроцедураОбработкиВыбранныхРейсов)

	ПараметрыФормы = Новый Структура;

	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ПараметрыФормы.Вставить("Контрагент", Объект.Контрагент);
	КонецЕсли;

	Оповещение = Новый ОписаниеОповещения(ПроцедураОбработкиВыбранныхРейсов, ЭтотОбъект);

	ОткрытьФорму("Документ.РейсОтПоставщика.ФормаВыбора", ПараметрыФормы, ЭтаФорма, , , , Оповещение,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

	ЭтаФорма.Модифицированность = Истина;

КонецПроцедуры

&НаКлиенте
Процедура Док__ЗаполнитьНаОснованииРейсовОтПоставщиков(Команда)
	ЗаполнитьНаОснованииРейсовОтПоставщиков("ОбработатьВыбранныеРейсыПоПоставкам");
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыбранныеРейсыПоПоставкам(Результат, ДопПараметры) Экспорт
	ОбработатьВыбранныеРейсыПоПоставкамНаСервере(Результат, ДопПараметры);
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыбранныеРейсыПоПоставкамНаСервере(Результат, ДопПараметры)

	РезультатЗапроса = Документы.РейсОтПоставщика.ПолучитьДокументыКОформлениюПоступленияЗатратПоРейсам(Результат);

	СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("0А-000075");//Доставка товара покупателям
	СтатьяРасходовБУ = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("0А-000075");//Доставка товара покупателям
	ЗаполнитьТЧРасходы(РезультатЗапроса, СтатьяРасходов);

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧРасходы(РезультатЗапроса, СтатьяРасходов)

	ВыборкаДок = РезультатЗапроса.Выбрать();
	Пока ВыборкаДок.Следующий() Цикл
		ОплатаВодителю = ВыборкаДок.СУММА;

		ОплатаВодителю = Окр(Документы.РейсОтПоставщика.СкорректироватьСуммуПоСтавкеНДС(ВыборкаДок.Рейс,
			ОплатаВодителю, ВыборкаДок.Рейс.СтавкаНДС), 0);

		ВыборкаДокПодразделение = ПолучитьПодразделение(ВыборкаДок.Документ);

		НоваяСтрока = Объект.Расходы.Добавить();
		НоваяСтрока.Содержание = ВыборкаДок.ЗаказНаДоставку.АдресНаПогрузке + " "
			+ АльтерраОбщегоНазначения.ПолучитьАдресФилиала(ВыборкаДокПодразделение);
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = ОплатаВодителю;
		НоваяСтрока.Сумма = ОплатаВодителю;
		ПеремСтавкаНДС = ВыборкаДок.СтавкаНДС;
		Если ТипЗнч(ПеремСтавкаНДС) = Тип("ПеречислениеСсылка.СтавкиНДС") Тогда
			НоваяСтрока.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоРеквизиту("ПеречислениеСтавкаНДС", ПеремСтавкаНДС);
		Иначе
			НоваяСтрока.СтавкаНДС = ПеремСтавкаНДС;
		КонецЕсли;
		ПересчитатьНДС(НоваяСтрока);

		НоваяСтрока.СтатьяРасходов = СтатьяРасходов;
		НоваяСтрока.СтатьяРасходовБУ = СтатьяРасходов;
		НоваяСтрока.АналитикаРасходов = ВыборкаДокПодразделение;
		НоваяСтрока.Подразделение = ВыборкаДокПодразделение;
		НоваяСтрока.ОснованиеЗатрат = ВыборкаДок.Документ;
		НоваяСтрока.СкладОснованияЗатрат = СкладОснованияЗатрат(ВыборкаДок.Документ);

		НоваяСтрока.Рейсы = ВыборкаДок.Рейс;
		НоваяСтрока.ЗаказНаДоставку = ВыборкаДок.ЗаказНаДоставку;

	КонецЦикла;

	Объект.СуммаДокумента = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(Объект.Расходы, Объект.ЦенаВключаетНДС);

	ОбновитьДанныеПоТН();

КонецПроцедуры

//Новый вариант заполнения без регистра
&НаКлиенте
Процедура Док__ЗаполнитьНаОснованииРейсовОтПоставщиков2После(Команда)
	ЗаполнитьНаОснованииРейсовОтПоставщиков("ОбработатьВыбранныеРейсыПоПоставкам2");
КонецПроцедуры

&НаСервере
Процедура ОбработатьВыбранныеРейсыПоПоставкам2(Результат, ДопПараметры) Экспорт

	СтатьяРасходов = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("0А-000075");//Доставка товара покупателям
	СтатьяРасходовБУ = ПланыВидовХарактеристик.СтатьиРасходов.НайтиПоКоду("0А-000075");//Доставка товара покупателям

	мРезультатЗапроса = ПолучитьДокументыПоРейсу(Результат);
	//ЗАКУПКА
	ВыборкаРейсов = мРезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Рейс");
	Пока ВыборкаРейсов.Следующий() Цикл
		Рейс = ВыборкаРейсов.Рейс;

		ВыборкаЗаказыНаДоставку = ВыборкаРейсов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЗаказНаДоставку");
		Пока ВыборкаЗаказыНаДоставку.Следующий() Цикл
			ВыборкаЗаказыПоставщику = ВыборкаЗаказыНаДоставку.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,
				"ЗаказПоставщику");
			Пока ВыборкаЗаказыПоставщику.Следующий() Цикл
				СуммаПоступлений = ВыборкаЗаказыПоставщику.СуммаДокумента;
				РаспределенныеДеньгиНаДоставку = ВыборкаЗаказыПоставщику.РаспределенныеДеньгиНаДоставку;
				РаспределенныеДеньгиНаДоставку = Документы.РейсОтПоставщика.СкорректироватьСуммуПоСтавкеНДС(Рейс,
					РаспределенныеДеньгиНаДоставку, Рейс.СтавкаНДС);

				СуммаРаспределили = 0;
				ВыборкаДок = ВыборкаЗаказыПоставщику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
				Пока ВыборкаДок.Следующий() Цикл
					Коэффициент= РаспределенныеДеньгиНаДоставку / СуммаПоступлений;
					ОплатаВодителю = Окр(Коэффициент * ВыборкаДок.СуммаДокумента, 0);
					СуммаРаспределили = СуммаРаспределили + ОплатаВодителю;

					ВыборкаДокПодразделение = ПолучитьПодразделение(ВыборкаДок.ДокОснование);

					НоваяСтрока = Объект.Расходы.Добавить();
					НоваяСтрока.Содержание = ВыборкаДок.ЗаказНаДоставку.АдресНаПогрузке + " "
						+ АльтерраОбщегоНазначения.ПолучитьАдресФилиала(ВыборкаДокПодразделение);
					НоваяСтрока.Количество = 1;
					НоваяСтрока.Цена = ОплатаВодителю;
					НоваяСтрока.Сумма = ОплатаВодителю;
					НоваяСтрока.СтавкаНДС = Рейс.СтавкаНДС;
					ПересчитатьНДС(НоваяСтрока);

					НоваяСтрока.СтатьяРасходов = СтатьяРасходов;
					НоваяСтрока.СтатьяРасходовБУ = СтатьяРасходов;
					НоваяСтрока.АналитикаРасходов = ВыборкаДокПодразделение;
					НоваяСтрока.Подразделение = ВыборкаДокПодразделение;
					НоваяСтрока.ОснованиеЗатрат = ВыборкаДок.ДокОснование;
					НоваяСтрока.СкладОснованияЗатрат = СкладОснованияЗатрат(ВыборкаДок.ДокОснование);

					НоваяСтрока.Рейсы = Рейс;
					НоваяСтрока.ЗаказНаДоставку = ВыборкаДок.ЗаказНаДоставку;
				КонецЦикла;
				НоваяСтрока.Цена = НоваяСтрока.Цена + РаспределенныеДеньгиНаДоставку - СуммаРаспределили;
				НоваяСтрока.Сумма = НоваяСтрока.Цена;
				ПересчитатьНДС(НоваяСтрока);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	//ТРАНЗИТ
	ВыборкаРейсов = мРезультатЗапроса[5].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Рейс");
	Пока ВыборкаРейсов.Следующий() Цикл
		Рейс = ВыборкаРейсов.Рейс;

		ВыборкаЗаказыНаДоставку = ВыборкаРейсов.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ЗаказНаДоставку");
		Пока ВыборкаЗаказыНаДоставку.Следующий() Цикл
			ВыборкаЗаказыПоставщику = ВыборкаЗаказыНаДоставку.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,
				"ЗаказПоставщику");
			Пока ВыборкаЗаказыПоставщику.Следующий() Цикл
				ВыборкаДок = ВыборкаЗаказыПоставщику.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "");
				Коэффициент = ВыборкаДок.Количество();

				ФактическаяСтоимостьДоставки = Окр(Рейс.ФактическаяСтоимостьДоставки, 0);
				ФактическаяСтоимостьДоставки = Документы.РейсОтПоставщика.СкорректироватьСуммуПоСтавкеНДС(Рейс,
					ФактическаяСтоимостьДоставки, Рейс.СтавкаНДС);
				СуммаРаспределили = 0;
				Пока ВыборкаДок.Следующий() Цикл
					ОплатаВодителю = Окр(ФактическаяСтоимостьДоставки / Коэффициент, 0);
					СуммаРаспределили = СуммаРаспределили + ОплатаВодителю;

					Подразделение = ВыборкаДок.ЗаказКлиента.Подразделение;

					НоваяСтрока = Объект.Расходы.Добавить();
					НоваяСтрока.Содержание = ВыборкаДок.ЗаказНаДоставку.АдресНаПогрузке + " "
						+ АльтерраОбщегоНазначения.ПолучитьАдресФилиала(Подразделение);
					НоваяСтрока.Количество = 1;
					НоваяСтрока.Цена = ОплатаВодителю;
					НоваяСтрока.Сумма = ОплатаВодителю;
					НоваяСтрока.СтавкаНДС = Рейс.СтавкаНДС;
					ПересчитатьНДС(НоваяСтрока);

					НоваяСтрока.СтатьяРасходов = СтатьяРасходов;
					НоваяСтрока.СтатьяРасходовБУ = СтатьяРасходов;
					НоваяСтрока.АналитикаРасходов = Подразделение;
					НоваяСтрока.Подразделение = Подразделение;
					НоваяСтрока.ОснованиеЗатрат = ВыборкаДок.ДокОснование;
					НоваяСтрока.СкладОснованияЗатрат = ВыборкаДок.ЗаказКлиента.Склад;

					НоваяСтрока.Рейсы = Рейс;
					НоваяСтрока.ЗаказНаДоставку = ВыборкаДок.ЗаказНаДоставку;
				КонецЦикла;
				НоваяСтрока.Цена = НоваяСтрока.Цена + ФактическаяСтоимостьДоставки - СуммаРаспределили;
				НоваяСтрока.Сумма = НоваяСтрока.Цена;
				ПересчитатьНДС(НоваяСтрока);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	Объект.СуммаДокумента = ЦенообразованиеКлиентСервер.ПолучитьСуммуДокумента(Объект.Расходы, Объект.ЦенаВключаетНДС);

	ОбновитьДанныеПоТН();

КонецПроцедуры

&НаСервере
Функция ПолучитьДокументыПоРейсу(мРейсов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка КАК Рейс,
	|	РейсОтПоставщикаРасчетДоставки.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ДокЗаказПоставщику.Ссылка КАК ЗаказПоставщику,
	|	ПриобретениеТоваровУслуг.Ссылка КАК ДокОснование,
	|	ПриобретениеТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РейсОтПоставщикаРасчетДоставки.РаспределенныеДеньгиНаДоставку КАК РаспределенныеДеньгиНаДоставку
	|ПОМЕСТИТЬ ВТ_ДокументыПоПоставкам
	|ИЗ
	|	Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|			ПО ДокЗаказПоставщику.Ссылка = ПриобретениеТоваровУслуг.ЗаказПоставщику
	|				И (ПриобретениеТоваровУслуг.Проведен)
	|		ПО РейсОтПоставщикаРасчетДоставки.ДокументОснование = ДокЗаказПоставщику.Ссылка
	|ГДЕ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка В(&мРейсов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка КАК Рейс,
	|	РейсОтПоставщикаРасчетДоставки.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ДокЗаказПоставщику.Ссылка КАК ЗаказПоставщику,
	|	РеализацияТоваровУслуг.Ссылка КАК ДокОснование,
	|	РейсОтПоставщикаРасчетДоставки.РаспределенныеДеньгиНаДоставку КАК РаспределенныеДеньгиНаДоставку,
	|	ДокЗаказКлиента.Ссылка КАК ЗаказКлиента
	|ПОМЕСТИТЬ ВТ_ДокументыПродажи
	|ИЗ
	|	Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокЗаказКлиента
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|				ПО ДокЗаказКлиента.Ссылка = РеализацияТоваровУслуг.ЗаказКлиента
	|					И (РеализацияТоваровУслуг.Проведен)
	|			ПО ДокЗаказПоставщику.ДокументОснование = ДокЗаказКлиента.Ссылка
	|				И (ДокЗаказКлиента.Проведен)
	|		ПО РейсОтПоставщикаРасчетДоставки.ДокументОснование = ДокЗаказПоставщику.Ссылка
	|ГДЕ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка В(&мРейсов)
	|	И ДокЗаказПоставщику.Склад.Транзит
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(ЗаказКлиентаТовары.Номенклатура) КАК УслугДоставки,
	|	ЗаказКлиентаТовары.Ссылка КАК ЗаказКлиента
	|ПОМЕСТИТЬ ВТ_УслугДоставки
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка В
	|			(ВЫБРАТЬ
	|				ВТ_ДокументыПродажи.ЗаказКлиента КАК ЗаказКлиента
	|			ИЗ
	|				ВТ_ДокументыПродажи КАК ВТ_ДокументыПродажи)
	|	И ЗаказКлиентаТовары.Номенклатура В ИЕРАРХИИ(&грУслугДоставки)
	|	И ЗаказКлиентаТовары.Ссылка.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыПродажи.Рейс КАК Рейс,
	|	ВТ_ДокументыПродажи.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ВТ_ДокументыПродажи.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ВТ_ДокументыПродажи.ДокОснование КАК ДокОснование,
	|	ВТ_ДокументыПродажи.РаспределенныеДеньгиНаДоставку КАК РаспределенныеДеньгиНаДоставку,
	|	ВТ_ДокументыПродажи.ЗаказКлиента КАК ЗаказКлиента,
	|	ВТ_УслугДоставки.УслугДоставки КАК УслугДоставки,
	|	ЕСТЬNULL(ВТ_УслугДоставки.УслугДоставки, 0) КАК УслугДоставки1
	|ПОМЕСТИТЬ ДокументыПоТранзитам
	|ИЗ
	|	ВТ_ДокументыПродажи КАК ВТ_ДокументыПродажи
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_УслугДоставки КАК ВТ_УслугДоставки
	|		ПО ВТ_ДокументыПродажи.ЗаказКлиента = ВТ_УслугДоставки.ЗаказКлиента
	|ГДЕ
	|	ЕСТЬNULL(ВТ_УслугДоставки.УслугДоставки, 0) > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДокументыПоПоставкам.Рейс КАК Рейс,
	|	ВТ_ДокументыПоПоставкам.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ВТ_ДокументыПоПоставкам.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ВТ_ДокументыПоПоставкам.ДокОснование КАК ДокОснование,
	|	ВТ_ДокументыПоПоставкам.СуммаДокумента КАК СуммаДокумента,
	|	ВТ_ДокументыПоПоставкам.РаспределенныеДеньгиНаДоставку КАК РаспределенныеДеньгиНаДоставку
	|ИЗ
	|	ВТ_ДокументыПоПоставкам КАК ВТ_ДокументыПоПоставкам
	|ГДЕ
	|	НЕ ВТ_ДокументыПоПоставкам.ЗаказПоставщику В
	|				(ВЫБРАТЬ
	|					ДокументыПоТранзитам.ЗаказПоставщику КАК ЗаказПоставщику
	|				ИЗ
	|					ДокументыПоТранзитам КАК ДокументыПоТранзитам)
	|ИТОГИ
	|	СУММА(СуммаДокумента),
	|	МАКСИМУМ(РаспределенныеДеньгиНаДоставку)
	|ПО
	|	Рейс,
	|	ЗаказНаДоставку,
	|	ЗаказПоставщику
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокументыПоТранзитам.Рейс КАК Рейс,
	|	ДокументыПоТранзитам.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ДокументыПоТранзитам.ЗаказПоставщику КАК ЗаказПоставщику,
	|	ДокументыПоТранзитам.ДокОснование КАК ДокОснование,
	|	ДокументыПоТранзитам.РаспределенныеДеньгиНаДоставку КАК РаспределенныеДеньгиНаДоставку,
	|	ДокументыПоТранзитам.ЗаказКлиента КАК ЗаказКлиента,
	|	ДокументыПоТранзитам.УслугДоставки КАК УслугДоставки
	|ИЗ
	|	ДокументыПоТранзитам КАК ДокументыПоТранзитам
	|ИТОГИ
	|	МАКСИМУМ(РаспределенныеДеньгиНаДоставку)
	|ПО
	|	Рейс,
	|	ЗаказНаДоставку,
	|	ЗаказПоставщику";

	Запрос.УстановитьПараметр("мРейсов", мРейсов);
	Запрос.УстановитьПараметр("грУслугДоставки", АльтерраОбщегоНазначения.ПолучитьГруппуУслугДоставкиОбщую());

	РезультатЗапроса = Запрос.ВыполнитьПакет();

	Возврат РезультатЗапроса;

КонецФункции

&НаСервере
Функция стар_ПолучитьДокументыПоРейсу(мРейсов) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка КАК Рейс,
	|	РейсОтПоставщикаРасчетДоставки.ЗаказНаДоставку КАК ЗаказНаДоставку,
	|	ДокЗаказПоставщику.Ссылка КАК ЗаказПоставщику,
	|	ПриобретениеТоваровУслуг.Ссылка КАК Преобретение,
	|	ДокЗаказКлиента.Ссылка КАК ЗаказКлиенту,
	|	РеализацияТоваровУслуг.Ссылка КАК Реализация,
	|	ПриобретениеТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	|	РейсОтПоставщикаРасчетДоставки.РаспределенныеДеньгиНаДоставку КАК РаспределенныеДеньгиНаДоставку
	|ИЗ
	|	Документ.РейсОтПоставщика.РасчетДоставки КАК РейсОтПоставщикаРасчетДоставки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ДокЗаказПоставщику
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ДокЗаказКлиента
	|				ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|				ПО ДокЗаказКлиента.Ссылка = РеализацияТоваровУслуг.ЗаказКлиента
	|					И (РеализацияТоваровУслуг.Проведен)
	|			ПО ДокЗаказПоставщику.ДокументОснование = ДокЗаказКлиента.Ссылка
	|				И (ДокЗаказКлиента.Проведен)
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|			ПО ДокЗаказПоставщику.Ссылка = ПриобретениеТоваровУслуг.ЗаказПоставщику
	|				И (ПриобретениеТоваровУслуг.Проведен)
	|		ПО РейсОтПоставщикаРасчетДоставки.ДокументОснование = ДокЗаказПоставщику.Ссылка
	|ГДЕ
	|	РейсОтПоставщикаРасчетДоставки.Ссылка В(&мРейсов)
	|ИТОГИ
	|	СУММА(СуммаДокумента),
	|	СУММА(РаспределенныеДеньгиНаДоставку)
	|ПО
	|	Рейс,
	|	ЗаказНаДоставку,
	|	ЗаказПоставщику";

	Запрос.УстановитьПараметр("мРейсов", мРейсов);

	РезультатЗапроса = Запрос.Выполнить();

	Возврат РезультатЗапроса;

КонецФункции

#КонецОбласти

#Область СтатьяРасходовБУ

&НаКлиенте
Процедура Док_ТоварыСтатьяРасходовБУНачалоВыбораПосле(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИдентификаторСтроки", Элементы.Расходы.ТекущаяСтрока);
	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовБУВыборЗавершение", ЭтотОбъект,
		ДополнительныеПараметры);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Статья", Элементы.Расходы.ТекущиеДанные.СтатьяРасходовБУ);
	ПараметрыФормы.Вставить("ПараметрыВыбора", Элемент.ПараметрыВыбора);

	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовБУВыборЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Строка = Объект.Расходы.НайтиПоИдентификатору(ДополнительныеПараметры.ИдентификаторСтроки);
	Строка.СтатьяРасходовБУ = Результат;

КонецПроцедуры

&НаКлиенте
Процедура Док__ЗаполнитьСтатьюРасходовБУПосле(Команда)

	ВыделенныеСтроки = Элементы.Расходы.ВыделенныеСтроки;

	Если Объект.Расходы.Количество() = 0 Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'В список ""Расходы"" не введено ни одной строки.'"));
		Возврат;
	ИначеЕсли ВыделенныеСтроки.Количество() = 0 Тогда
		ПоказатьПредупреждение( , НСтр("ru = 'В списке ""Расходы"" не выделено ни одной строки.'"));
		Возврат;
	КонецЕсли;

	ОписаниеОповещения = Новый ОписаниеОповещения("СтатьяРасходовБУВыборДляЗаполненияЗавершение", ЭтотОбъект);

	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Статья", Элементы.Расходы.ТекущиеДанные.СтатьяРасходовБУ);
	ПараметрыФормы.Вставить("ПараметрыВыбора", Элементы.РасходыСтатьяРасходовБУ.ПараметрыВыбора);

	ОткрытьФорму("ОбщаяФорма.ФормаВыбораСтатьи", ПараметрыФормы, ЭтаФорма, , , , ОписаниеОповещения);

КонецПроцедуры

&НаКлиенте
Процедура СтатьяРасходовБУВыборДляЗаполненияЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ВыделенныеСтроки = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(Элементы.Расходы.ВыделенныеСтроки);
	Для Каждого Строка Из ВыделенныеСтроки Цикл
		ДанныеСтроки = Объект.Расходы.НайтиПоИдентификатору(Строка);
		ДанныеСтроки.СтатьяРасходовБУ = Результат;
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура Док_РасходыОснованиеЗатратПриИзмененииПосле(Элемент)
	СтрокаРасходов =Элементы.Расходы.ТекущиеДанные;
	СтрокаРасходов.СкладОснованияЗатрат=СкладОснованияЗатрат(СтрокаРасходов.ОснованиеЗатрат);
	ОбновитьДанныеПоТН();
КонецПроцедуры

&НаСервере
Функция СкладОснованияЗатрат(ДокументЗатрат)

	Если ТипЗнч(ДокументЗатрат) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Возврат ДокументЗатрат.СкладПолучатель;
	ИначеЕсли ТипЗнч(ДокументЗатрат) = Тип("ДокументСсылка.ОбращениеКлиента") Тогда
		Возврат Документы.ОбращениеКлиента.ПолучитьСклад(ДокументЗатрат);
	Иначе
		Возврат ДокументЗатрат.Склад;
	КонецЕсли;

КонецФункции

&НаСервере
Функция ПолучитьПодразделение(ОснованияЗатрат)

	Если ТипЗнч(ОснованияЗатрат) = Тип("ДокументСсылка.ОбращениеКлиента") Тогда
		Возврат Документы.ОбращениеКлиента.ПолучитьПодразделение(ОснованияЗатрат);
	Иначе
		Возврат ОснованияЗатрат.Подразделение;
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура Док_РасходыСтатьяРасходовПриИзмененииПосле(Элемент)

	СтрокаТаблицы = Элементы.Расходы.ТекущиеДанные;
	Если Не значениезаполнено(СтрокаТаблицы.СтатьяРасходовБУ) Тогда
		СтрокаТаблицы.СтатьяРасходовБУ = СтрокаТаблицы.СтатьяРасходов;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Док_УстановитьОбъектРасходовПосле(Команда)

	ВыделенныеСтроки = Элементы.Расходы.ВыделенныеСтроки;

	Если Объект.Расходы.Количество() = 0 Или Не ЗначениеЗаполнено(ВыделенныеСтроки) Тогда
		ПоказатьПредупреждение(Неопределено, НСтр(
			"ru = 'Для выполнения команды требуется выделить строки табличной части.'"));
		Возврат;
	КонецЕсли;

	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ХозяйственнаяОперация", Объект.ХозяйственнаяОперация);

	ВыбранноеЗначение = Неопределено;
	ОткрытьФорму(
		"Общаяформа.ФормаВыбораОбъектовАналитики", СтруктураПараметры, ЭтаФорма, , , ,
		Новый ОписаниеОповещения("УстановитьОбъектРасходовЗавершение", ЭтотОбъект, Новый Структура("ВыделенныеСтроки",
		ВыделенныеСтроки)), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьОбъектРасходовЗавершение(Результат, ДополнительныеПараметры) Экспорт

	ВыделенныеСтроки = ДополнительныеПараметры.ВыделенныеСтроки;
	ВыбранноеЗначение = Результат;

	Если ЗначениеЗаполнено(ВыбранноеЗначение) Тогда

		Для Каждого Строка Из ВыделенныеСтроки Цикл

			СтрокаТаблицы = Объект.Расходы.НайтиПоИдентификатору(Строка);
			Если СтрокаТаблицы <> Неопределено Тогда
				СтрокаТаблицы.ОбъектРасходов = ВыбранноеЗначение.ОбъектРасходов;
				СтрокаТаблицы.АналитикаОбъекта = ВыбранноеЗначение.АналитикаОбъекта;
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Док_ПересчитатьТаблицуПосле(Команда)

	Если Не Объект.Ссылка.Пустая() И ЗначениеЗаполнено(Объект.Расходы) И ЗначениеЗаполнено(Объект.Организация) Тогда
		ПересчитатьРасходы();
		ЭтаФорма.Модифицированность = Истина;
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПересчитатьРасходы()

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Приобретения.Рейсы КАК Рейсы
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК Приобретения
	|ГДЕ
	|	Приобретения.Ссылка = &Ссылка
	|	И Приобретения.Рейсы <> НЕОПРЕДЕЛЕНО
	|	И Приобретения.Рейсы.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	Приобретения.Рейсы";

	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	Если ЗначениеЗаполнено(РезультатЗапроса) Тогда
		Объект.Расходы.Очистить();
		МассивРезультатов = Документы.ПриобретениеУслугПрочихАктивов.ПолучитьДокументыПродажи(РезультатЗапроса,
			Объект.Организация);
		Для Каждого Результат Из МассивРезультатов Цикл
			Если ЗначениеЗаполнено(Результат) Тогда
				ТЗ = ПолучитьИзВременногоХранилища(Результат);
				Если ЗначениеЗаполнено(ТЗ) Тогда
					Для Каждого Стр Из ТЗ Цикл
						НоваяСтрока = Объект.Расходы.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		ОбновитьДанныеПоТН();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура Док_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Не Отказ И ТекущийОбъект.ДополнительныеСвойства.Свойство(
		"ОтправитьИнформациюВЧат_ИзменениеПриходныхДокументовВЗакрытомПериоде") Тогда
		Документы.КорректировкаПриобретения.ОтправитьИнформациюВЧат_ИзменениеПриходныхДокументовВЗакрытомПериоде(
			ТекущийОбъект.Организация, ТекущийОбъект.Дата,
			ТекущийОбъект.ДополнительныеСвойства.ОтправитьИнформациюВЧат_ИзменениеПриходныхДокументовВЗакрытомПериоде);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
